---
title: Rectangle
classe: Autodesk.Revit.DB.Rectangle
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# Rectangle

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 Bottom { get; set; }` | `rectangle.Bottom` | Int32 |
| `Boolean IsValidObject { get; }` | `rectangle.IsValidObject` | Boolean |
| `Int32 Left { get; set; }` | `rectangle.Left` | Int32 |
| `Int32 Right { get; set; }` | `rectangle.Right` | Int32 |
| `Int32 Top { get; set; }` | `rectangle.Top` | Int32 |
| `Void Dispose()` | `rectangle.Dispose()` | Void |
| `Boolean IsNormalized()` | `rectangle.IsNormalized()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```